We tested running `terraform init/apply`

```
var.idp_integration_name
  IdP integration name that will be shown in Control Plane.

  Enter a value: okta-test

var.okta_app_name
  The name of the Okta Application that will be created.

  Enter a value: okta-test

data.cyral_saml_certificate.this: Reading...
data.cyral_saml_certificate.this: Read complete after 3s [id=f7635a2XXXXXXf58-08acee2976ea]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.cyral_saml_configuration.this will be read during apply
  # (config refers to values not yet known)
 <= data "cyral_saml_configuration" "this" {
      + allowed_clock_skew                    = (known after apply)
      + back_channel_supported                = (known after apply)
      + base_64_saml_metadata_document        = (known after apply)
      + disable_force_authentication          = (known after apply)
      + disable_post_binding_authn_request    = (known after apply)
      + disable_post_binding_logout           = (known after apply)
      + disable_post_binding_response         = (known after apply)
      + disable_using_jwks_url                = (known after apply)
      + disable_validate_signature            = (known after apply)
      + disable_want_assertions_signed        = (known after apply)
      + disable_want_authn_requests_signed    = (known after apply)
      + gui_order                             = (known after apply)
      + hide_on_login_page                    = (known after apply)
      + id                                    = (known after apply)
      + ldap_group_attribute                  = (known after apply)
      + name_id_policy_format                 = (known after apply)
      + principal_type                        = (known after apply)
      + saml_xml_key_name_tranformer          = (known after apply)
      + signature_type                        = (known after apply)
      + signing_certificate                   = (known after apply)
      + single_logout_service_url             = (known after apply)
      + single_sign_on_service_url            = (known after apply)
      + sync_mode                             = (known after apply)
      + want_assertions_encrypted             = (known after apply)
      + xml_sig_key_info_key_name_transformer = (known after apply)
    }

  # cyral_integration_idp_saml.this will be created
  + resource "cyral_integration_idp_saml" "this" {
      + id                         = (known after apply)
      + idp_metadata_xml           = (known after apply)
      + saml_draft_id              = (known after apply)
      + single_sign_on_service_url = (known after apply)
    }

  # cyral_integration_idp_saml_draft.this will be created
  + resource "cyral_integration_idp_saml_draft" "this" {
      + disable_idp_initiated_login = false
      + display_name                = "okta-test"
      + id                          = (known after apply)
      + idp_type                    = "okta"
      + service_provider_metadata   = (known after apply)
      + sp_metadata                 = (known after apply)
    }

  # okta_app_saml.this will be created
  + resource "okta_app_saml" "this" {
      + accessibility_self_service  = false
      + acs_endpoints               = (known after apply)
      + assertion_signed            = true
      + audience                    = (known after apply)
      + authn_context_class_ref     = "urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport"
      + auto_submit_toolbar         = false
      + certificate                 = (known after apply)
      + destination                 = (known after apply)
      + digest_algorithm            = "SHA256"
      + embed_url                   = (known after apply)
      + entity_key                  = (known after apply)
      + entity_url                  = (known after apply)
      + features                    = (known after apply)
      + hide_ios                    = false
      + hide_web                    = false
      + honor_force_authn           = true
      + http_post_binding           = (known after apply)
      + http_redirect_binding       = (known after apply)
      + id                          = (known after apply)
      + key_id                      = (known after apply)
      + keys                        = (known after apply)
      + label                       = "okta-test"
      + logo_url                    = (known after apply)
      + metadata                    = (known after apply)
      + metadata_url                = (known after apply)
      + name                        = (known after apply)
      + recipient                   = (known after apply)
      + response_signed             = true
      + saml_signed_request_enabled = false
      + saml_version                = "2.0"
      + sign_on_mode                = (known after apply)
      + signature_algorithm         = "RSA_SHA256"
      + single_logout_certificate   = "XXXXXXXXXXXXXXXXXXXXXXXXXItOdHXXXXXxeU5rxwIHGKq3I9gTHvp62erOhp0tDiXXXXXXXXXXXXXXdxN1886wPKSY9Ua4N6+nbpGR/xRfWiHC3nMPHvFIGlztKh/SEmjgqngEoFUpSEG1mh41HuQnOnF84L/gPw=="
      + single_logout_issuer        = (known after apply)
      + single_logout_url           = (known after apply)
      + skip_groups                 = false
      + skip_users                  = false
      + sp_issuer                   = (known after apply)
      + sso_url                     = (known after apply)
      + status                      = "ACTIVE"
      + subject_name_id_format      = "urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress"
      + subject_name_id_template    = "${user.userName}"
      + user_name_template          = "${source.login}"
      + user_name_template_type     = "BUILT_IN"

      + attribute_statements {
          + name      = "EMAIL"
          + namespace = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type      = "EXPRESSION"
          + values    = [
              + "user.email",
            ]
        }
      + attribute_statements {
          + name      = "FIRST_NAME"
          + namespace = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type      = "EXPRESSION"
          + values    = [
              + "user.firstName",
            ]
        }
      + attribute_statements {
          + name      = "LAST_NAME"
          + namespace = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type      = "EXPRESSION"
          + values    = [
              + "user.lastName",
            ]
        }
      + attribute_statements {
          + filter_type  = "REGEX"
          + filter_value = ".*"
          + name         = "groups"
          + namespace    = "urn:oasis:names:tc:SAML:2.0:attrname-format:basic"
          + type         = "GROUP"
          + values       = []
        }
    }

  # random_uuid.this will be created
  + resource "random_uuid" "this" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + integration_idp_okta_id = (known after apply)
  + okta_app_saml_id        = (known after apply)
╷
│ Warning: Deprecated attribute
│ 
│   on main.tf line 77, in resource "okta_app_saml" "this":
│   77:       groups,
│ 
│ The attribute "groups" is deprecated. Refer to the provider documentation for details.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_uuid.this: Creating...
random_uuid.this: Creation complete after 0s [id=6650cfde-8abe-1132-3646-XXXX]
cyral_integration_idp_saml_draft.this: Creating...
cyral_integration_idp_saml_draft.this: Creation complete after 2s [id=XX]
okta_app_saml.this: Creating...
okta_app_saml.this: Creation complete after 4s [id=XXX]
data.cyral_saml_configuration.this: Reading...
data.cyral_saml_configuration.this: Read complete after 0s [id=616dbbc4-6XX9a9-acd7-f4e40c6b93dc]
cyral_integration_idp_saml.this: Creating...
cyral_integration_idp_saml.this: Creation complete after 2s [id=XX]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

integration_idp_okta_id = "XXXX"
okta_app_saml_id = "XXXX"
```

After this, by checking the CP and Okta Panel:
![image](https://github.com/cyralinc/terraform-okta-idp/assets/37452507/37654ba9-5cfa-4d44-9236-dd37bd29ce83)
![image](https://github.com/cyralinc/terraform-okta-idp/assets/37452507/c26b2216-bd19-48d0-8105-aae35df852ec)


After assigning the users in okta application, we made a test:


https://github.com/cyralinc/terraform-okta-idp/assets/37452507/ec85b70a-71b6-4d13-a024-e2b27ebc0226

This is working as expected